app/Controllers/Tasks.php

INSERT INTO `task` (`description`, `created_at`, `updated_at`) VALUES ('test', '2022-02-12 21:56:18', '2022-02-12 21:56:18')
---
	public function create()
	{
		$task = new Task($this->request->getPost());

		if ($this->model->insert($task)) {